clear;
clc;

% 设置全局字体为 Times New Roman，加粗，大小为 20
set(0, 'DefaultTextFontName', 'Times New Roman');
set(0, 'DefaultTextFontSize', 20);
set(0, 'DefaultAxesFontWeight', 'bold');
set(0, 'DefaultAxesFontSize', 20);
set(0, 'DefaultLegendFontSize', 20);

% 定义颜色
color_all = [
    0.329411764705882, 0.650980392156863, 0.619607843137255;
    0.745098039215686, 0.870588235294118, 0.874509803921569;
    0.894117647058824, 0.905882352941177, 0.894117647058824;
    0.0156862745098039, 0.282352941176471, 0.419607843137255;
    0.305882352941177, 0.541176470588235, 0.317647058823529;
    1.0, 0.5, 0.0;
    0.5, 0.7, 0.4;
    0, 0, 0.75
];

CList = [
    0, 0, 0.75;
    1.0, 0.5, 0.0
];

% 输入矩阵数据

ENSO_RCM_data_origin =[0	0.418561078194869	0.114487492428348	0.0336397588807644;
                        0.368305778114847	0	0.386393901475077	0.0539742130891393;
                        0.103671906104217	0.453538769558239	0	0.23;
                        0.0345583377990796	0.107803202917400	0.25	0;]

% ENSO_RCM_data_new =    [ 0	0.666729393086104	0.218780161833289	0.0273249875546131;
% 0.596578940345759	0	0.619926452318887	0.0933230550347170;
% 0.206414894805039	0.669156066024961	0	0.364252151731023;
% 0.0566020771722174	0.218927268717217	0.438735249616621	0]


% Station_RCM_data_origin =  [     0    0.5274    0.4898             0.0782    0.0785    0.0767;
%     0.6110         0    0.3836           0.0889    0.0934    0.0906;
%     0.4224    0.32         0          0.0835    0.0851    0.0810;
% 
%     0.0950    0.1033    0.0936          0    0.4432    0.4810;
%     0.0964    0.1072    0.0990          0.4855         0    0.8305;
%     0.0908    0.1003    0.0924          0.5217    0.8146         0];

Station_RCM_new = [
    0.         0.53051627 0.4842017  0.0818659  0.0809053  0.08006022;
    0.61095638 0.         0.37625335 0.09482851 0.09771271 0.09665769;
    0.42079339 0.3202584 0.         0.08626835 0.08524749 0.08280603;
    0.09873704 0.1070945  0.09942609 0.         0.44963905 0.49100852;
    0.10195797 0.1152566  0.10484102 0.48693074 0.         0.83062519;
    0.09862042 0.11023053 0.09949524 0.52935631 0.81964418 0.
];


%% 

load("MCM_index.mat")
ENSO_MCM_data=index

Station_MCM_data = [
    0.0,        0.94948033, 0.93202917, 0.74246392, 0.73529798, 0.73197989;
    0.94959851, 0.0,        0.8838911,  0.76357956, 0.76277527, 0.76001821;
    0.9317788,  0.88464994, 0.0,        0.74128303, 0.73502287, 0.72934859;
    0.76408609, 0.7860325,  0.76387727, 0.0,        0.94266522, 0.95189464;
    0.77355494, 0.79939409, 0.77747986, 0.94505578, 0.0,        0.98579498;
    0.77145185, 0.79649908, 0.77240631, 0.95564106, 0.98608219, 0.0
];

A = [...
    0.00000000, 0.94948033, 0.93202917, 0.74246392, 0.73529798, 0.73197989;
    0.94959851, 0.00000000, 0.88389110, 0.76357956, 0.76277527, 0.76001821;
    0.93177880, 0.88464994, 0.00000000, 0.74128303, 0.73502287, 0.72934859;
    0.76408609, 0.78603250, 0.76387727, 0.00000000, 0.94266522, 0.95189464;
    0.77355494, 0.79939409, 0.77747986, 0.94505578, 0.00000000, 0.98579498;
    0.77145185, 0.79649908, 0.77240631, 0.95564106, 0.98608219, 0.00000000];


matrix_name = 'A';

% 去除对角线
no_diag = A(~eye(size(A, 1)));
data = no_diag(:);

% K-means 聚类
k = 2;  % 聚类数
opts = statset('MaxIter', 200, 'Display', 'final');  % 设置最大迭代次数为200
[labels, centers, sumd, D] = kmeans(no_diag, k, 'Distance', 'sqEuclidean', 'Replicates', 10, 'Options', opts);
% [labels, centers] = kmeans(no_diag, k); 

% 计算分类阈值（聚类中心的均值）
threshold = mean(centers);

% 绘图
% 设置图形属性
fig = figure('Color', 'white', 'Position', [100, 100, 800, 600]);

% 在图形中添加坐标轴
ax = axes(fig);

% 设置坐标轴的边框为开启（即显示边框）


% 在图形中绘制数据（例如：线性图）
plot(1:10, rand(1, 10));

% 设置图标题和标签（加粗和字体大小）
title('Sample Plot', 'FontWeight', 'bold', 'FontSize', 14);
xlabel('X Axis', 'FontWeight', 'bold', 'FontSize', 20);
ylabel('Y Axis', 'FontWeight', 'bold', 'FontSize', 12);

% 显示图形
grid on;
color_all(5, :)=0, 0, 0.75;
colors = [0, 0, 0.75;color_all(6, :) ];
labels_text = {'MCM [Without Causality]', 'MCM [With Causality]'};

for i = 1:2
    scatter(data(labels == i), 0.5*ones(sum(labels == i), 1), 100, 'MarkerFaceColor', colors(3-i, :), ...
        'MarkerEdgeColor', colors(3-i, :), 'DisplayName', labels_text{3-i});
    hold on;
    
end

% scatter(centers, 0.5 * ones(k, 1), 100,  'MarkerFaceColor', 'r' , ...
%         'MarkerEdgeColor', 'r','DisplayName', 'Cluster Centers');


% 分类阈值线
y_max = 1;
line([threshold threshold], [0 y_max], 'Color', 'black', 'LineStyle', '--', 'LineWidth', 2, 'DisplayName', 'Classification Threshold');
yticks([]);
set(ax, 'Box', 'on');
set(gca, 'FontSize', 25);  


% % 设置图例
% legend('FontWeight', 'bold', 'Box', 'off', 'Location', 'northeast','FontSize', 30);

% 保存图片
exportgraphics(fig, [matrix_name, '.jpg'], 'Resolution', 1000);
% 显示图形
hold off;
 


length(data(labels == 1))
threshold
data(labels == 1)
