% load('colorData.mat')
load("MCM_index.mat")
ENSO_MCM_data=index

Station_MCM_data = [
    0.0,        0.94948033, 0.93202917, 0.74246392, 0.73529798, 0.73197989;
    0.94959851, 0.0,        0.8838911,  0.76357956, 0.76277527, 0.76001821;
    0.9317788,  0.88464994, 0.0,        0.74128303, 0.73502287, 0.72934859;
    0.76408609, 0.7860325,  0.76387727, 0.0,        0.94266522, 0.95189464;
    0.77355494, 0.79939409, 0.77747986, 0.94505578, 0.0,        0.98579498;
    0.77145185, 0.79649908, 0.77240631, 0.95564106, 0.98608219, 0.0
];
data=Station_MCM_data

% load('station.mat')
% 创建热力图
imagesc(data);
colormap(othercolor('Greens6')); % 设置颜色图
colorbar;
h = colorbar;            % 创建或获取 colorbar 句柄
h.FontSize = 15;         % 设置字体大小（可根据需要调整）
h.FontWeight = 'bold';   % 设置字体加粗

% 隐藏 x 轴和 y 轴刻度
set(gca, 'XTick', []);
set(gca, 'YTick', []);

